Code-Newborn/STM32H743VITX_UCOSIII308/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
 ******************************************************************************
 * @file           : main.h
 * @brief          : Header for main.c file.
 *                   This file contains the common defines of the application.
 ******************************************************************************
 * @attention
 *
 * <h2><center>&copy; Copyright (c) 2023 STMicroelectronics.
 * All rights reserved.</center></h2>
 *
 * This software component is licensed by ST under BSD 3-Clause license,
 * the "License"; You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                        opensource.org/licenses/BSD-3-Clause
 *
 ******************************************************************************
 */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32h7xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler( void );

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define mem0addr            0
#define mem1addr            0
#define memsize             0
#define memblen             0
#define meminc              0
#define ILI_RST_Pin         GPIO_PIN_3
#define ILI_RST_GPIO_Port   GPIOE
#define LED_Pin             GPIO_PIN_1
#define LED_GPIO_Port       GPIOA
#define DCMI_PWDN_Pin       GPIO_PIN_7
#define DCMI_PWDN_GPIO_Port GPIOA
#define DCMI_RST_Pin        GPIO_PIN_4
#define DCMI_RST_GPIO_Port  GPIOC
#define T_PEN_Pin           GPIO_PIN_0
#define T_PEN_GPIO_Port     GPIOB
#define T_CS_Pin            GPIO_PIN_1
#define T_CS_GPIO_Port      GPIOB
#define SCCB_SCL_Pin        GPIO_PIN_10
#define SCCB_SCL_GPIO_Port  GPIOB
#define SCCB_SDA_Pin        GPIO_PIN_11
#define SCCB_SDA_GPIO_Port  GPIOB
#define ILI_CTR_Pin         GPIO_PIN_5
#define ILI_CTR_GPIO_Port   GPIOB
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
